關於d3 

之前跟了兩組視頻
  1. 一組是 : youtube chennel : d3Vienno 的d3.tourial
  2. 一組是 : youtube chennel : cs50 的Data Visualization with D3 by Michael Menz 
  
前前後後，做了幾個常見的數據分析圖，但是依據是非常醜陋的
醜陋的原因有幾個
1.沒有去依據數據的範圍去階層的呈顯數據
2.沒辦法讓用戶與數據互動
3.單一個圖，還有搭配其他的網站設計，略顯單調

d3.目前在國內業界的運用不知道如何，
目前國外有幾個實際運用的網站，是值得我們去觀摩學習
1. new york time -國外媒體
2. 538 -數據分析網站，運動或者選舉類別

目前學習起來有幾個要注意的地方
1. 教學多半都是基於d3.v3版本，目前已經修改到d3.v5。版本之間的差異性還蠻大的
   因此，如果想要依據視頻學習，還是需要先看版本是否符合。

2.d3.很大一部分就是在抄弄(manipulate)DOM, 
  
3.之前學過p5.js，學得兩者很像。一個使用svg,一個使用canvas.
  
4.d3自帶很多數據模型公式，可讓object的value可以依據數據的型態去做改變

